In [8]:
import numpy as np
import pandas as pd

In [9]:
d = {'col1': pd.Series([1,2,3,4]),
     'col2': pd.Series([4,3,2,1])}
df = pd.DataFrame(d)
df

   col1  col2
0     1     4
1     2     3
2     3     2
3     4     1

In [11]:
d = {'col1': [1,2,3,4],
     'col2': [4,3,2,1]}
df = pd.DataFrame(d, index = ['a','b','c','d'])
df

   col1  col2
a     1     4
b     2     3
c     3     2
d     4     1

In [12]:
l = [{'col1': 1, 'col2' : 4}, {'col1': 2, 'col2' : 3},  
     {'col1': 3, 'col2' : 2}, {'col1': 4, 'col2' : 1, 'col3' : 3}]

df = pd.DataFrame(l, index = ['a','b','c','e'])
df

   col1  col2  col3
a     1     4   NaN
b     2     3   NaN
c     3     2   NaN
e     4     1   3.0

In [18]:
df['col2']['c']

2

In [20]:
df['col4'] = df['col1'] + df['col2']
df

   col1  col2  col3  col4
a     1     4   NaN     5
b     2     3   NaN     5
c     3     2   NaN     5
e     4     1   3.0     5

In [22]:
df.insert(1,'col0',df['col4']+df['col2'])
df

   col1  col0  col2  col3  col4
a     1     9     4   NaN     5
b     2     8     3   NaN     5
c     3     7     2   NaN     5
e     4     6     1   3.0     5

In [23]:
df.assign(col3 = 3)

   col1  col0  col2  col3  col4
a     1     9     4     3     5
b     2     8     3     3     5
c     3     7     2     3     5
e     4     6     1     3     5